; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p4---int100n150-m25---int100c200---s60---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level13 level13)
(sum level0 level16 level16)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level13 level14)
(sum level1 level16 level17)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level13 level15)
(sum level2 level16 level18)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level13 level16)
(sum level3 level16 level19)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level13 level17)
(sum level4 level16 level20)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level13 level18)
(sum level5 level16 level21)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level13 level19)
(sum level6 level16 level22)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level13 level20)
(sum level7 level16 level23)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level13 level21)
(sum level8 level16 level24)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level13 level22)
(sum level9 level16 level25)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level13 level23)
(sum level10 level16 level26)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level13 level24)
(sum level11 level16 level27)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level13 level25)
(sum level12 level16 level28)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level13 level26)
(sum level13 level16 level29)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level13 level27)
(sum level14 level16 level30)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level13 level28)
(sum level15 level16 level31)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level13 level29)
(sum level16 level16 level32)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level13 level30)
(sum level17 level16 level33)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level13 level31)
(sum level18 level16 level34)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level13 level32)
(sum level19 level16 level35)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level13 level33)
(sum level20 level16 level36)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level13 level34)
(sum level21 level16 level37)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level13 level35)
(sum level22 level16 level38)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level13 level36)
(sum level23 level16 level39)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level13 level37)
(sum level24 level16 level40)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level13 level38)
(sum level25 level16 level41)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level13 level39)
(sum level26 level16 level42)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level13 level40)
(sum level27 level16 level43)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level13 level41)
(sum level28 level16 level44)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level29 level13 level42)
(sum level29 level16 level45)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level30 level13 level43)
(sum level30 level16 level46)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level31 level13 level44)
(sum level31 level16 level47)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level32 level13 level45)
(sum level32 level16 level48)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level7 level40)
(sum level33 level10 level43)
(sum level33 level13 level46)
(sum level33 level16 level49)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level7 level41)
(sum level34 level10 level44)
(sum level34 level13 level47)
(sum level34 level16 level50)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level7 level42)
(sum level35 level10 level45)
(sum level35 level13 level48)
(sum level35 level16 level51)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level7 level43)
(sum level36 level10 level46)
(sum level36 level13 level49)
(sum level36 level16 level52)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level7 level44)
(sum level37 level10 level47)
(sum level37 level13 level50)
(sum level37 level16 level53)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level7 level45)
(sum level38 level10 level48)
(sum level38 level13 level51)
(sum level38 level16 level54)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level7 level46)
(sum level39 level10 level49)
(sum level39 level13 level52)
(sum level39 level16 level55)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level7 level47)
(sum level40 level10 level50)
(sum level40 level13 level53)
(sum level40 level16 level56)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level7 level48)
(sum level41 level10 level51)
(sum level41 level13 level54)
(sum level41 level16 level57)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level7 level49)
(sum level42 level10 level52)
(sum level42 level13 level55)
(sum level42 level16 level58)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level7 level50)
(sum level43 level10 level53)
(sum level43 level13 level56)
(sum level43 level16 level59)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level7 level51)
(sum level44 level10 level54)
(sum level44 level13 level57)
(sum level44 level16 level60)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level7 level52)
(sum level45 level10 level55)
(sum level45 level13 level58)
(sum level45 level16 level61)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level7 level53)
(sum level46 level10 level56)
(sum level46 level13 level59)
(sum level46 level16 level62)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level7 level54)
(sum level47 level10 level57)
(sum level47 level13 level60)
(sum level47 level16 level63)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level7 level55)
(sum level48 level10 level58)
(sum level48 level13 level61)
(sum level48 level16 level64)
(sum level48 level23 level71)
(sum level49 level1 level50)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level7 level56)
(sum level49 level10 level59)
(sum level49 level13 level62)
(sum level49 level16 level65)
(sum level49 level23 level72)
(sum level50 level1 level51)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level7 level57)
(sum level50 level10 level60)
(sum level50 level13 level63)
(sum level50 level16 level66)
(sum level50 level23 level73)
(sum level51 level1 level52)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level7 level58)
(sum level51 level10 level61)
(sum level51 level13 level64)
(sum level51 level16 level67)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level7 level59)
(sum level52 level10 level62)
(sum level52 level13 level65)
(sum level52 level16 level68)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level7 level60)
(sum level53 level10 level63)
(sum level53 level13 level66)
(sum level53 level16 level69)
(sum level53 level23 level76)
(sum level54 level1 level55)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level7 level61)
(sum level54 level10 level64)
(sum level54 level13 level67)
(sum level54 level16 level70)
(sum level54 level23 level77)
(sum level55 level1 level56)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level7 level62)
(sum level55 level10 level65)
(sum level55 level13 level68)
(sum level55 level16 level71)
(sum level55 level23 level78)
(sum level56 level1 level57)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level7 level63)
(sum level56 level10 level66)
(sum level56 level13 level69)
(sum level56 level16 level72)
(sum level56 level23 level79)
(sum level57 level1 level58)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level57 level7 level64)
(sum level57 level10 level67)
(sum level57 level13 level70)
(sum level57 level16 level73)
(sum level57 level23 level80)
(sum level58 level1 level59)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level58 level7 level65)
(sum level58 level10 level68)
(sum level58 level13 level71)
(sum level58 level16 level74)
(sum level58 level23 level81)
(sum level59 level1 level60)
(sum level59 level3 level62)
(sum level59 level4 level63)
(sum level59 level7 level66)
(sum level59 level10 level69)
(sum level59 level13 level72)
(sum level59 level16 level75)
(sum level59 level23 level82)
(sum level60 level1 level61)
(sum level60 level3 level63)
(sum level60 level4 level64)
(sum level60 level7 level67)
(sum level60 level10 level70)
(sum level60 level13 level73)
(sum level60 level16 level76)
(sum level60 level23 level83)
(sum level61 level1 level62)
(sum level61 level3 level64)
(sum level61 level4 level65)
(sum level61 level7 level68)
(sum level61 level10 level71)
(sum level61 level13 level74)
(sum level61 level16 level77)
(sum level61 level23 level84)
(sum level62 level1 level63)
(sum level62 level3 level65)
(sum level62 level4 level66)
(sum level62 level7 level69)
(sum level62 level10 level72)
(sum level62 level13 level75)
(sum level62 level16 level78)
(sum level62 level23 level85)
(sum level63 level1 level64)
(sum level63 level3 level66)
(sum level63 level4 level67)
(sum level63 level7 level70)
(sum level63 level10 level73)
(sum level63 level13 level76)
(sum level63 level16 level79)
(sum level63 level23 level86)
(sum level64 level1 level65)
(sum level64 level3 level67)
(sum level64 level4 level68)
(sum level64 level7 level71)
(sum level64 level10 level74)
(sum level64 level13 level77)
(sum level64 level16 level80)
(sum level64 level23 level87)
(sum level65 level1 level66)
(sum level65 level3 level68)
(sum level65 level4 level69)
(sum level65 level7 level72)
(sum level65 level10 level75)
(sum level65 level13 level78)
(sum level65 level16 level81)
(sum level65 level23 level88)
(sum level66 level1 level67)
(sum level66 level3 level69)
(sum level66 level4 level70)
(sum level66 level7 level73)
(sum level66 level10 level76)
(sum level66 level13 level79)
(sum level66 level16 level82)
(sum level66 level23 level89)
(sum level67 level1 level68)
(sum level67 level3 level70)
(sum level67 level4 level71)
(sum level67 level7 level74)
(sum level67 level10 level77)
(sum level67 level13 level80)
(sum level67 level16 level83)
(sum level67 level23 level90)
(sum level68 level1 level69)
(sum level68 level3 level71)
(sum level68 level4 level72)
(sum level68 level7 level75)
(sum level68 level10 level78)
(sum level68 level13 level81)
(sum level68 level16 level84)
(sum level69 level1 level70)
(sum level69 level3 level72)
(sum level69 level4 level73)
(sum level69 level7 level76)
(sum level69 level10 level79)
(sum level69 level13 level82)
(sum level69 level16 level85)
(sum level70 level1 level71)
(sum level70 level3 level73)
(sum level70 level4 level74)
(sum level70 level7 level77)
(sum level70 level10 level80)
(sum level70 level13 level83)
(sum level70 level16 level86)
(sum level71 level1 level72)
(sum level71 level3 level74)
(sum level71 level4 level75)
(sum level71 level7 level78)
(sum level71 level10 level81)
(sum level71 level13 level84)
(sum level71 level16 level87)
(sum level72 level1 level73)
(sum level72 level3 level75)
(sum level72 level4 level76)
(sum level72 level7 level79)
(sum level72 level10 level82)
(sum level72 level13 level85)
(sum level72 level16 level88)
(sum level73 level1 level74)
(sum level73 level3 level76)
(sum level73 level4 level77)
(sum level73 level7 level80)
(sum level73 level10 level83)
(sum level73 level13 level86)
(sum level73 level16 level89)
(sum level74 level1 level75)
(sum level74 level3 level77)
(sum level74 level4 level78)
(sum level74 level7 level81)
(sum level74 level10 level84)
(sum level74 level13 level87)
(sum level74 level16 level90)
(sum level75 level1 level76)
(sum level75 level3 level78)
(sum level75 level4 level79)
(sum level75 level7 level82)
(sum level75 level10 level85)
(sum level75 level13 level88)
(sum level76 level1 level77)
(sum level76 level3 level79)
(sum level76 level4 level80)
(sum level76 level7 level83)
(sum level76 level10 level86)
(sum level76 level13 level89)
(sum level77 level1 level78)
(sum level77 level3 level80)
(sum level77 level4 level81)
(sum level77 level7 level84)
(sum level77 level10 level87)
(sum level77 level13 level90)
(sum level78 level1 level79)
(sum level78 level3 level81)
(sum level78 level4 level82)
(sum level78 level7 level85)
(sum level78 level10 level88)
(sum level79 level1 level80)
(sum level79 level3 level82)
(sum level79 level4 level83)
(sum level79 level7 level86)
(sum level79 level10 level89)
(sum level80 level1 level81)
(sum level80 level3 level83)
(sum level80 level4 level84)
(sum level80 level7 level87)
(sum level80 level10 level90)
(sum level81 level1 level82)
(sum level81 level3 level84)
(sum level81 level4 level85)
(sum level81 level7 level88)
(sum level82 level1 level83)
(sum level82 level3 level85)
(sum level82 level4 level86)
(sum level82 level7 level89)
(sum level83 level1 level84)
(sum level83 level3 level86)
(sum level83 level4 level87)
(sum level83 level7 level90)
(sum level84 level1 level85)
(sum level84 level3 level87)
(sum level84 level4 level88)
(sum level85 level1 level86)
(sum level85 level3 level88)
(sum level85 level4 level89)
(sum level86 level1 level87)
(sum level86 level3 level89)
(sum level86 level4 level90)
(sum level87 level1 level88)
(sum level87 level3 level90)
(sum level88 level1 level89)
(sum level89 level1 level90)

(connected l0 l3)
(fuelcost level23 l0 l3)
(connected l0 l4)
(fuelcost level16 l0 l4)
(connected l0 l5)
(fuelcost level13 l0 l5)
(connected l1 l2)
(fuelcost level7 l1 l2)
(connected l1 l5)
(fuelcost level3 l1 l5)
(connected l2 l1)
(fuelcost level7 l2 l1)
(connected l2 l3)
(fuelcost level10 l2 l3)
(connected l2 l5)
(fuelcost level7 l2 l5)
(connected l3 l0)
(fuelcost level23 l3 l0)
(connected l3 l2)
(fuelcost level10 l3 l2)
(connected l3 l4)
(fuelcost level4 l3 l4)
(connected l4 l0)
(fuelcost level16 l4 l0)
(connected l4 l3)
(fuelcost level4 l4 l3)
(connected l4 l5)
(fuelcost level1 l4 l5)
(connected l5 l0)
(fuelcost level13 l5 l0)
(connected l5 l1)
(fuelcost level3 l5 l1)
(connected l5 l2)
(fuelcost level7 l5 l2)
(connected l5 l4)
(fuelcost level1 l5 l4)

(at t0 l1)
(fuel t0 level90)
(= (total-cost) 0)

(at p0 l4)
(at p1 l1)
(at p2 l0)
(at p3 l2)
)

(:goal
(and
(at p0 l2)
(at p1 l0)
(at p2 l2)
(at p3 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 4
2. (drive t0 l1 l2 level83 level7 level90)
   deleted: (at t0 l1) (fuel t0 level90)
   added: (at t0 l2) (fuel t0 level83)
   goals met: 0 of 4
3. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 4
4. (drive t0 l2 l3 level73 level10 level83)
   deleted: (at t0 l2) (fuel t0 level83)
   added: (at t0 l3) (fuel t0 level73)
   goals met: 0 of 4
5. (drive t0 l3 l4 level69 level4 level73)
   deleted: (at t0 l3) (fuel t0 level73)
   added: (at t0 l4) (fuel t0 level69)
   goals met: 0 of 4
6. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 0 of 4
7. (drive t0 l4 l0 level53 level16 level69)
   deleted: (at t0 l4) (fuel t0 level69)
   added: (at t0 l0) (fuel t0 level53)
   goals met: 0 of 4
8. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 4
9. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 4
10. (drive t0 l0 l5 level40 level13 level53)
   deleted: (at t0 l0) (fuel t0 level53)
   added: (at t0 l5) (fuel t0 level40)
   goals met: 1 of 4
11. (unload p3 t0 l5)
   deleted: (in p3 t0)
   added: (at p3 l5)
   goals met: 2 of 4
12. (drive t0 l5 l2 level33 level7 level40)
   deleted: (at t0 l5) (fuel t0 level40)
   added: (at t0 l2) (fuel t0 level33)
   goals met: 2 of 4
13. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 3 of 4
14. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 4 of 4
